app/controllers/admin_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "forgot_pw_answer", "forgot_pw_question", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def del_user
    User.find_by_id(params[:id]).delete
---
DELETE FROM "users" WHERE "users"."id" = 2
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1