app/controllers/login_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "forgot_pw_answer", "forgot_pw_question", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def process_login
    @user = User.find_by_name(params[:user][:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'd' LIMIT 1

  def forgot_pw1
    if params[:user][:name] == ''
      flash.now[:notice] = '帐号不能为空'
      render :forgot1
    else
      user = User.find_by_name(params[:user][:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = '' LIMIT 1

    def forgot2
      @forgot_pw_question = User.find_by_name(session[:forgot_pw_user_name])[:forgot_pw_question]
---
SELECT "users".* FROM "users" WHERE "users"."name" = '' LIMIT 1

    def forgot_pw2
      @forgot_pw_question = User.find_by_name(session[:forgot_pw_user_name])[:forgot_pw_question]
---
SELECT "users".* FROM "users" WHERE "users"."name" = '1' LIMIT 1

    def change_password
      user = User.find_by_name(session[:forgot_pw_user_name])
      if params[:user][:password] == '' || params[:user][:confirmation] == ''
        flash.now[:notice]='输入不能为空'
        render :forgot3
      else
        #p '.................................'
        #puts params[:user][:password]
        #p params[:user][:password_confirmation]
        if params[:user][:password] != params[:user][:password_confirmation]
          flash.now[:notice]='两次密码输入不一致'
          render :forgot3
        else
          session[:name]= user.name
          user.password = params[:user][:password]
          user.password_confirmation = params[:user][:password_confirmation]
          user.save
---
SELECT "users".* FROM "users" WHERE "users"."name" = '1' LIMIT 1
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 16  [["password_digest", "$2a$10$nU5zsCTC1zyEIaheCDFb7.Ozz5SSkx2zgfGyPmcR63.USepVMdnkO"], ["updated_at", Sat, 27 Dec 2014 06:19:35 UTC +00:00]]